import requests
import telebot
from bs4 import BeautifulSoup as b
from telebot import types
from datetime import datetime

den = datetime.today().strftime("%d" + "." + "%m" + "." + "%Y")

API_KEY = '5867077652:AAEOazAHPbt0p4nFFFjfyyMwIOnQpTz2hPo'
yandex = 'https://poezdato.net/raspisanie-poezdov/novodachnaya--okruzhnaya/' + den + '/'
print(yandex)
er2r = f'ЭР2Р — один из последних массовых электропоездов СССР. Производился в ' +\
       f'Риге, сделано 1024 вагона (это 20 км сплошной электрички!)\nГлавной ' +\
       f'новинкой ЭР2Р стало рекуперативно-реостатное торможение, работающее ' +\
       f'на скоростях более 50 км/ч благодаря выработке электричества ' +\
       f'обратно в контактную сеть. Дальше уже поезд тормозил своими ' +\
       f'реостатами, и, наконец, просто трением — колодками. При этом вес ' +\
       f'электропоезда увеличился, поэтому конструкторам пришлось сократить ' +\
       f'длину вагона и поставить более выносливые тележки ТУР-01.\n' +\
       f'Если ты помнишь приятное гудение электрички в раннем детстве — скорее ' +\
       f'всего, это был именно ЭР2Р. На фото: ЭР2Р несётся от Марка к Новодачной'

def parser(link):
    req = requests.get(link)
    soup = b(req.text, 'html.parser')
    times = soup.find_all('span', class_='_time')
    all_times = [c.text for c in times]
    int_times = []
    print(all_times)
    now = datetime.now()
    current_time = now.strftime("%H:%M")
    print(current_time)
    for j in range(len(all_times)):
        str1 = all_times[j]
        a = int(str1[0]) * 1000 + int(str1[1]) * 100 + int(str1[3]) * 10 + int(str1[4])
        int_times.append(a)
    d = int(current_time[0]) * 1000 + int(current_time[1]) * 100 + int(current_time[3]) * 10 + int(current_time[4])
    for i in range(len(int_times)):
        if int_times[2 * i] > d:
            if int_times[2 * i] < 99:
                imsogladN1 = str(int_times[2 * i])
                imsoglad0 = str(int_times[2 * i + 2])
                return ('Следующая будет в 00:'
                        + imsogladN1[0] + imsogladN1[1] + ', но если не успеваешь, то можно на 00:' + imsoglad0[0]
                        + imsoglad0[1])
            if int_times[2 * i] < 999:
                imsoglad = str(int_times[2 * i])
                imsoglad2 = str(int_times[2 * i + 2])
                return ('Следующая будет в 0' + imsoglad[0] + ':'
                        + imsoglad[1] + imsoglad[2] + ', но если не успеваешь, то можно на 0' + imsoglad2[0] + ':'
                        + imsoglad2[1] + imsoglad2[2])
            if int_times[i] >= 999:
                imsoglad3 = str(int_times[2 * i])
                imsoglad4 = str(int_times[2 * i + 2])
                return ('Следующая будет в ' + imsoglad3[0] + imsoglad3[1] + ':'
                        + imsoglad3[2] + imsoglad3[3] + ', но если не успеваешь, то можно на ' + imsoglad4[0] +
                        imsoglad4[1] + ':' + imsoglad4[2] + imsoglad4[3])


bot = telebot.TeleBot(API_KEY)

keyboard1 = types.ReplyKeyboardMarkup(True)

@bot.message_handler(commands=['start'])
def start(message):
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    item1 = types.KeyboardButton("Информация🤓")
    item2 = types.KeyboardButton("Расписание📅")
    item3 = types.KeyboardButton('История-ржомба💣')
    markup.add(item1, item2, item3)
    question = f'<b>Привет, {message.from_user.first_name}</b>!\nМеня зовут Электричкер-бот. Я расскажу об ' \
               f'электропоездах Савёловского направления, помогу свалить с физтеха, могу даже пошутить (если ' \
               f'разрешиш разреши пожалусто😊) \nТак что тебе нужно?'
    bot.send_message(message.chat.id, question, parse_mode='html', reply_markup=markup)
    markup.add(item1, item2, item3)

@bot.message_handler(content_types=['text'])
def text_message(message):
    if message.text == 'Расписание' or message.text == "Расписание📅":
        list_Timetable = parser(yandex)
        bot.send_message(message.chat.id, list_Timetable, parse_mode='html')
    if message.text == 'Информация' or message.text == "Информация🤓":
        bot.send_message(message.chat.id, f'Выбери модель электрички: \n \n'
                                          f'⌛Архивные: ЭР2Р, ЭР2Т, ЭД2Т, ЭД4МК, ЭД4МКМ-АЭРО \n'
                                          f'⚙Действующие: ЭД4М, ЭП2Д, ЭГ2Тв "Иволга" \n'
                                          f'🏙Будущие: ЭГЭ2Тв', parse_mode='html')
    if message.text == 'ЭР2Р' or message.text == 'Эр2р' or message.text == 'эр2р':
        bot.send_photo(message.chat.id, photo='https://railgallery.ru/photo/00/99/84/99841.jpg', caption=er2r, parse_mode='html')
    if message.text == 'История-ржомба' or message.text == 'история-ржомба' or message.text == 'История-ржомба💣':
        bot.send_message(message.chat.id, f'Ооо, вот это по-нашему! \n'
                                          f'Какую хочешь: баян или посвежее?')
    if message.text == 'Баян' or message.text == 'баян':
        bot.send_message(message.chat.id,
                         f'Светало... слегка. Ничего не подозревающий машинист наивно вел свой электропоезд.'
                         f' Он опрометчиво забыл, что первое апреля уже наступило. Именно поэтому он очень удивился,'
                         f' когда рельсы вдруг закончились. Бедный машинист... Разгадка этой негуманной шутки'
                         f' состояла в том, что за ночной перерыв в работе электричек студенты покрасили рельсы между'
                         f' "Новодачной" и "Долгопрудной" в черный цвет. Через год (прямо перед первым апреля) от'
                         f' электродепо пришла в ректорат просьба — рельсы больше не красить.'
                         f' Да и мы садистами не были :)', parse_mode='html')
    if message.text == 'Посвежее' or message.text == 'посвежее':
        bot.send_photo(message.chat.id, photo='https://sun9-66.userapi.com/impg/v03Vk-yKx6PCRdP8Ffe4ybtt-_jJzki2ha4Eiw/c-luThXtRsg.jpg?size=1455x739&quality=96&sign=1b3dda075a419f90763f7ab52e308746&type=album',
                         caption=f'В 2020-м году РЖД передавало моторвагонное депо "Лобня" ЦППК. По закону, в этот процесс'
                         f' может ввязаться кто-то другой, и хотя обычно эта проблема решалась тендерами с узкими'
                         f' требованиями, направленными на конкретную компанию, в этот раз монополист решил проблему'
                         f' неожиданно: <b>депо ТЧ-14 Лобня было выставлено на Авито</b>. Любой желающий мог связаться'
                         f' с РЖД и всего за 270 млн рублей в год арендовать имущество главного электричкерского'
                         f' депо Савёловского направления. И можно только догадываться, сколько приколистов позвонило'
                         f' на этот бедный номер...', parse_mode='html')
    if (message.text != 'Посвежее' and message.text != 'Баян' and message.text != 'Информация'
        and message.text != 'Расписание' and message.text != 'История-ржомба' and message.text != 'посвежее'
        and message.text != 'баян' and message.text != 'история-ржомба' and message.text != 'ЭР2Р'
        and message.text != 'Эр2р' and message.text != 'эр2р' and message.text != "Информация🤓"
        and message.text  != "История-ржомба💣" and message.text != "Расписание📅"):
        text1 = f'Я так не играю :( \n{message.from_user.first_name}, пожалуйста, отправь что-нибудь другое!'
        bot.send_message(message.chat.id, text1, parse_mode='html')


bot.polling()
